kurakens/ESP32BLECombo-JIS/src/ESP32BLEComboJIS.cpp
#include "ESP32BLEComboJIS.h"
#include <string>

namespace {
constexpr uint8_t KEYBOARD_ID = 0x01;
constexpr uint8_t MOUSE_ID = 0x02;
constexpr uint8_t GAMEPAD_ID = 0x03;
constexpr uint8_t SHIFT = 0x80;

static const uint8_t kKeyboardMap[] = {
    USAGE_PAGE(1), 0x01, USAGE(1), 0x06, COLLECTION(1), 0x01,
    REPORT_ID(1), KEYBOARD_ID,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0xE0, USAGE_MAXIMUM(1), 0xE7,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x08, HIDINPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x08, HIDINPUT(1), 0x01,
    REPORT_COUNT(1), 0x05, REPORT_SIZE(1), 0x01,
    USAGE_PAGE(1), 0x08, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x05,
    HIDOUTPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x03, HIDOUTPUT(1), 0x01,
    REPORT_COUNT(1), 0x06, REPORT_SIZE(1), 0x08,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x65,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0x00, USAGE_MAXIMUM(1), 0x65,
    HIDINPUT(1), 0x00, END_COLLECTION(0),
};

static const uint8_t kMouseMap[] = {
    USAGE_PAGE(1), 0x01, USAGE(1), 0x02, COLLECTION(1), 0x01,
    REPORT_ID(1), MOUSE_ID,
    USAGE(1), 0x01, COLLECTION(1), 0x00,
    USAGE_PAGE(1), 0x09, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x03,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x02,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x05, HIDINPUT(1), 0x01,
    USAGE_PAGE(1), 0x01, USAGE(1), 0x30, USAGE(1), 0x31, USAGE(1), 0x38,
    LOGICAL_MINIMUM(1), 0x81, LOGICAL_MAXIMUM(1), 0x7F,
    REPORT_SIZE(1), 0x08, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x06,
    END_COLLECTION(0), END_COLLECTION(0),
};

static const uint8_t kGamepadMap[] = {
    USAGE_PAGE(1), 0x01, USAGE(1), 0x05, COLLECTION(1), 0x01,
    REPORT_ID(1), GAMEPAD_ID,
    USAGE_PAGE(1), 0x09, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x10,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x10, HIDINPUT(1), 0x02,
    USAGE_PAGE(1), 0x01,
    USAGE(1), 0x30,
    USAGE(1), 0x31,
    USAGE(1), 0x32,
    USAGE(1), 0x35,
    LOGICAL_MINIMUM(2), 0x00, 0x80,
    LOGICAL_MAXIMUM(2), 0xFF, 0x7F,
    REPORT_SIZE(1), 0x10, REPORT_COUNT(1), 0x04, HIDINPUT(1), 0x02,
    USAGE(1), 0x39,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x08,
    PHYSICAL_MINIMUM(1), 0x00, PHYSICAL_MAXIMUM(2), 0x3B, 0x01,
    UNIT(1), 0x14,
    REPORT_SIZE(1), 0x04, REPORT_COUNT(1), 0x01, HIDINPUT(1), 0x42,
    REPORT_SIZE(1), 0x04, REPORT_COUNT(1), 0x01, HIDINPUT(1), 0x01,
    END_COLLECTION(0),
};

static const uint8_t kComboMap[] = {
    USAGE_PAGE(1), 0x01, USAGE(1), 0x06, COLLECTION(1), 0x01,
    REPORT_ID(1), KEYBOARD_ID,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0xE0, USAGE_MAXIMUM(1), 0xE7,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x08, HIDINPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x08, HIDINPUT(1), 0x01,
    REPORT_COUNT(1), 0x05, REPORT_SIZE(1), 0x01,
    USAGE_PAGE(1), 0x08, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x05,
    HIDOUTPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x03, HIDOUTPUT(1), 0x01,
    REPORT_COUNT(1), 0x06, REPORT_SIZE(1), 0x08,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x65,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0x00, USAGE_MAXIMUM(1), 0x65,
    HIDINPUT(1), 0x00, END_COLLECTION(0),
    USAGE_PAGE(1), 0x01, USAGE(1), 0x02, COLLECTION(1), 0x01,
    REPORT_ID(1), MOUSE_ID,
    USAGE(1), 0x01, COLLECTION(1), 0x00,
    USAGE_PAGE(1), 0x09, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x03,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x02,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x05, HIDINPUT(1), 0x01,
    USAGE_PAGE(1), 0x01, USAGE(1), 0x30, USAGE(1), 0x31, USAGE(1), 0x38,
    LOGICAL_MINIMUM(1), 0x81, LOGICAL_MAXIMUM(1), 0x7F,
    REPORT_SIZE(1), 0x08, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x06,
    END_COLLECTION(0), END_COLLECTION(0),
};

static const uint8_t kComboAllMap[] = {
    USAGE_PAGE(1), 0x01, USAGE(1), 0x06, COLLECTION(1), 0x01,
    REPORT_ID(1), KEYBOARD_ID,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0xE0, USAGE_MAXIMUM(1), 0xE7,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x08, HIDINPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x08, HIDINPUT(1), 0x01,
    REPORT_COUNT(1), 0x05, REPORT_SIZE(1), 0x01,
    USAGE_PAGE(1), 0x08, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x05,
    HIDOUTPUT(1), 0x02,
    REPORT_COUNT(1), 0x01, REPORT_SIZE(1), 0x03, HIDOUTPUT(1), 0x01,
    REPORT_COUNT(1), 0x06, REPORT_SIZE(1), 0x08,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x65,
    USAGE_PAGE(1), 0x07, USAGE_MINIMUM(1), 0x00, USAGE_MAXIMUM(1), 0x65,
    HIDINPUT(1), 0x00, END_COLLECTION(0),

    USAGE_PAGE(1), 0x01, USAGE(1), 0x02, COLLECTION(1), 0x01,
    REPORT_ID(1), MOUSE_ID,
    USAGE(1), 0x01, COLLECTION(1), 0x00,
    USAGE_PAGE(1), 0x09, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x03,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x02,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x05, HIDINPUT(1), 0x01,
    USAGE_PAGE(1), 0x01, USAGE(1), 0x30, USAGE(1), 0x31, USAGE(1), 0x38,
    LOGICAL_MINIMUM(1), 0x81, LOGICAL_MAXIMUM(1), 0x7F,
    REPORT_SIZE(1), 0x08, REPORT_COUNT(1), 0x03, HIDINPUT(1), 0x06,
    END_COLLECTION(0), END_COLLECTION(0),

    USAGE_PAGE(1), 0x01, USAGE(1), 0x05, COLLECTION(1), 0x01,
    REPORT_ID(1), GAMEPAD_ID,
    USAGE_PAGE(1), 0x09, USAGE_MINIMUM(1), 0x01, USAGE_MAXIMUM(1), 0x10,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x01,
    REPORT_SIZE(1), 0x01, REPORT_COUNT(1), 0x10, HIDINPUT(1), 0x02,
    USAGE_PAGE(1), 0x01,
    USAGE(1), 0x30, USAGE(1), 0x31, USAGE(1), 0x32, USAGE(1), 0x35,
    LOGICAL_MINIMUM(2), 0x00, 0x80,
    LOGICAL_MAXIMUM(2), 0xFF, 0x7F,
    REPORT_SIZE(1), 0x10, REPORT_COUNT(1), 0x04, HIDINPUT(1), 0x02,
    USAGE(1), 0x39,
    LOGICAL_MINIMUM(1), 0x00, LOGICAL_MAXIMUM(1), 0x08,
    PHYSICAL_MINIMUM(1), 0x00, PHYSICAL_MAXIMUM(2), 0x3B, 0x01,
    UNIT(1), 0x14,
    REPORT_SIZE(1), 0x04, REPORT_COUNT(1), 0x01, HIDINPUT(1), 0x42,
    REPORT_SIZE(1), 0x04, REPORT_COUNT(1), 0x01, HIDINPUT(1), 0x01,
    END_COLLECTION(0),
};

static const uint8_t asciimap[128] PROGMEM = {
    0,0,0,0,0,0,0,0,0x2a,0x2b,0x28,0,0,0,0,0,
    0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,
    0x2c,0x1e|SHIFT,0x34|SHIFT,0x20|SHIFT,0x21|SHIFT,0x22|SHIFT,0x24|SHIFT,0x34,
    0x26|SHIFT,0x27|SHIFT,0x25|SHIFT,0x2e|SHIFT,0x36,0x2d,0x37,0x38,
    0x27,0x1e,0x1f,0x20,0x21,0x22,0x23,0x24,0x25,0x26,
    0x33|SHIFT,0x33,0x36|SHIFT,0x2e,0x37|SHIFT,0x38|SHIFT,0x1f|SHIFT,
    0x04|SHIFT,0x05|SHIFT,0x06|SHIFT,0x07|SHIFT,0x08|SHIFT,0x09|SHIFT,0x0a|SHIFT,
    0x0b|SHIFT,0x0c|SHIFT,0x0d|SHIFT,0x0e|SHIFT,0x0f|SHIFT,0x10|SHIFT,0x11|SHIFT,
    0x12|SHIFT,0x13|SHIFT,0x14|SHIFT,0x15|SHIFT,0x16|SHIFT,0x17|SHIFT,0x18|SHIFT,
    0x19|SHIFT,0x1a|SHIFT,0x1b|SHIFT,0x1c|SHIFT,0x1d|SHIFT,
    0x2f,0x31,0x30,0x23|SHIFT,0x2d|SHIFT,0x35,
    0x04,0x05,0x06,0x07,0x08,0x09,0x0a,0x0b,0x0c,0x0d,0x0e,0x0f,0x10,0x11,
    0x12,0x13,0x14,0x15,0x16,0x17,0x18,0x19,0x1a,0x1b,0x1c,0x1d,
    0x2f|SHIFT,0x31|SHIFT,0x30|SHIFT,0x35|SHIFT,0
};
}

ESP32BLEComboJIS::ESP32BLEComboJIS()
    : m_connected(false), m_started(false), m_mode(ESP32BLEComboJISMode::KEYBOARD_MOUSE),
      m_keyPressDelayMs(20), m_keyReleaseDelayMs(20), m_keyIntervalDelayMs(10),
      m_server(nullptr), m_hid(nullptr), m_inputKeyboard(nullptr), m_outputKeyboard(nullptr),
      m_inputMouse(nullptr), m_inputGamepad(nullptr) {
    resetReports();
}

void ESP32BLEComboJISServerCallbacks::onConnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo) {
    (void)pServer; (void)connInfo; m_owner->handleConnected(true);
}

void ESP32BLEComboJISServerCallbacks::onDisconnect(NimBLEServer* pServer, NimBLEConnInfo& connInfo, int reason) {
    (void)connInfo; (void)reason; m_owner->handleConnected(false); pServer->advertiseOnDisconnect(true);
}

void ESP32BLEComboJIS::handleConnected(bool connected) { m_connected = connected; }

bool ESP32BLEComboJIS::keyboardEnabled() const {
    return m_mode == ESP32BLEComboJISMode::KEYBOARD_ONLY || m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE || m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD;
}

bool ESP32BLEComboJIS::mouseEnabled() const {
    return m_mode == ESP32BLEComboJISMode::MOUSE_ONLY || m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE || m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD;
}

bool ESP32BLEComboJIS::gamepadEnabled() const {
    return m_mode == ESP32BLEComboJISMode::GAMEPAD_ONLY || m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD;
}

bool ESP32BLEComboJIS::comboAllEnabled() const { return m_mode == ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD; }

void ESP32BLEComboJIS::resetReports() {
    memset(&m_keyReport, 0, sizeof(m_keyReport));
    memset(&m_mouseReport, 0, sizeof(m_mouseReport));
    memset(&m_gamepadReport, 0, sizeof(m_gamepadReport));
    m_gamepadReport.hat = HAT_CENTERED;
}

const uint8_t* ESP32BLEComboJIS::keyboardReportMap(size_t& len) { len = sizeof(kKeyboardMap); return kKeyboardMap; }
const uint8_t* ESP32BLEComboJIS::mouseReportMap(size_t& len) { len = sizeof(kMouseMap); return kMouseMap; }
const uint8_t* ESP32BLEComboJIS::comboReportMap(size_t& len) { len = sizeof(kComboMap); return kComboMap; }
const uint8_t* ESP32BLEComboJIS::gamepadReportMap(size_t& len) { len = sizeof(kGamepadMap); return kGamepadMap; }

uint16_t ESP32BLEComboJIS::resolveAppearance() const {
    if (m_config.appearance != ESP32BLEComboJISAppearance::AUTO) return static_cast<uint16_t>(m_config.appearance);
    switch (m_mode) {
        case ESP32BLEComboJISMode::KEYBOARD_ONLY: return static_cast<uint16_t>(ESP32BLEComboJISAppearance::KEYBOARD);
        case ESP32BLEComboJISMode::MOUSE_ONLY: return static_cast<uint16_t>(ESP32BLEComboJISAppearance::MOUSE);
        case ESP32BLEComboJISMode::GAMEPAD_ONLY: return static_cast<uint16_t>(ESP32BLEComboJISAppearance::GAMEPAD);
        case ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD: return static_cast<uint16_t>(ESP32BLEComboJISAppearance::GENERIC_HID_APPEARANCE);
        default: return static_cast<uint16_t>(ESP32BLEComboJISAppearance::GENERIC_HID_APPEARANCE);
    }
}

bool ESP32BLEComboJIS::initAddressOverride() {
    if (!m_config.useStaticAddress || m_config.staticAddress.isEmpty()) return true;
    NimBLEAddress addr(std::string(m_config.staticAddress.c_str()), BLE_OWN_ADDR_RANDOM);
    return NimBLEDevice::setOwnAddr(addr);
}

bool ESP32BLEComboJIS::begin(const ESP32BLEComboJISConfig& config) {
    if (m_started) return true;
    m_config = config;
    m_mode = config.mode;
    m_keyPressDelayMs = m_config.keyPressDelayMs;
    m_keyReleaseDelayMs = m_config.keyReleaseDelayMs;
    m_keyIntervalDelayMs = m_config.keyIntervalDelayMs;
    resetReports();

    if (m_config.useStaticAddress) initAddressOverride();
    NimBLEDevice::init(m_config.deviceName.c_str());
    if (m_config.enableSecurity) NimBLEDevice::setSecurityAuth(true, false, false);

    m_server = NimBLEDevice::createServer();
    m_server->setCallbacks(new ESP32BLEComboJISServerCallbacks(this));
    m_server->advertiseOnDisconnect(true);

    m_hid = new NimBLEHIDDevice(m_server);
    if (keyboardEnabled()) {
        m_inputKeyboard = m_hid->getInputReport(KEYBOARD_ID);
        m_outputKeyboard = m_hid->getOutputReport(KEYBOARD_ID);
    }
    if (mouseEnabled()) m_inputMouse = m_hid->getInputReport(MOUSE_ID);
    if (gamepadEnabled()) m_inputGamepad = m_hid->getInputReport(GAMEPAD_ID);

    m_hid->setManufacturer(m_config.manufacturer.c_str());
    m_hid->setPnp(0x02, m_config.vendorId, m_config.productId, m_config.productVersion);
    m_hid->setHidInfo(m_config.countryCode, m_config.hidFlags);

    size_t mapLen = 0;
    const uint8_t* map = nullptr;
    switch (m_mode) {
        case ESP32BLEComboJISMode::KEYBOARD_ONLY: map = keyboardReportMap(mapLen); break;
        case ESP32BLEComboJISMode::MOUSE_ONLY: map = mouseReportMap(mapLen); break;
        case ESP32BLEComboJISMode::GAMEPAD_ONLY: map = gamepadReportMap(mapLen); break;
        case ESP32BLEComboJISMode::KEYBOARD_MOUSE_GAMEPAD: map = kComboAllMap; mapLen = sizeof(kComboAllMap); break;
        default: map = comboReportMap(mapLen); break;
    }

    m_hid->setReportMap(const_cast<uint8_t*>(map), mapLen);
    m_hid->startServices();
    setBatteryLevel(m_config.batteryLevel);
    startAdvertising();
    m_started = true;
    return true;
}

void ESP32BLEComboJIS::startAdvertising() {
    NimBLEAdvertising* adv = m_server->getAdvertising();
    adv->setAppearance(resolveAppearance());
    adv->addServiceUUID(m_hid->getHidService()->getUUID());
    adv->enableScanResponse(false);
    adv->start();
}

void ESP32BLEComboJIS::end() {
    if (!m_started) return;
    NimBLEDevice::deinit(true);
    m_server = nullptr; m_hid = nullptr; m_inputKeyboard = nullptr; m_outputKeyboard = nullptr;
    m_inputMouse = nullptr; m_inputGamepad = nullptr; m_connected = false; m_started = false;
}

bool ESP32BLEComboJIS::isConnected() const { return m_connected; }
ESP32BLEComboJISMode ESP32BLEComboJIS::getMode() const { return m_mode; }
void ESP32BLEComboJIS::setBatteryLevel(uint8_t level) { m_config.batteryLevel = level; if (m_hid) m_hid->setBatteryLevel(level); }
void ESP32BLEComboJIS::setDeviceName(const String& name) { m_config.deviceName = name; }
void ESP32BLEComboJIS::setManufacturer(const String& manufacturer) { m_config.manufacturer = manufacturer; if (m_hid) m_hid->setManufacturer(manufacturer.c_str()); }
void ESP32BLEComboJIS::setKeyPressDelay(uint16_t ms) { m_keyPressDelayMs = ms; m_config.keyPressDelayMs = ms; }
void ESP32BLEComboJIS::setKeyReleaseDelay(uint16_t ms) { m_keyReleaseDelayMs = ms; m_config.keyReleaseDelayMs = ms; }
void ESP32BLEComboJIS::setKeyIntervalDelay(uint16_t ms) { m_keyIntervalDelayMs = ms; m_config.keyIntervalDelayMs = ms; }

void ESP32BLEComboJIS::sendKeyboardReport() {
    if (!m_connected || !m_inputKeyboard || !keyboardEnabled()) return;
    m_inputKeyboard->setValue(reinterpret_cast<uint8_t*>(&m_keyReport), sizeof(m_keyReport));
    m_inputKeyboard->notify();
}

void ESP32BLEComboJIS::sendMouseReport(int8_t x, int8_t y, int8_t wheel, uint8_t buttons) {
    if (!m_connected || !m_inputMouse || !mouseEnabled()) return;
    m_mouseReport.buttons = buttons; m_mouseReport.x = x; m_mouseReport.y = y; m_mouseReport.wheel = wheel;
    m_inputMouse->setValue(reinterpret_cast<uint8_t*>(&m_mouseReport), sizeof(m_mouseReport));
    m_inputMouse->notify();
}

void ESP32BLEComboJIS::sendGamepadReport() {
    if (!m_connected || !m_inputGamepad || !gamepadEnabled()) return;
    m_inputGamepad->setValue(reinterpret_cast<uint8_t*>(&m_gamepadReport), sizeof(m_gamepadReport));
    m_inputGamepad->notify();
}

bool ESP32BLEComboJIS::write(uint8_t c) {
    if (!keyboardEnabled()) return false;
    if (!press(c)) return false;
    delay(m_keyPressDelayMs);
    if (!release(c)) return false;
    delay(m_keyReleaseDelayMs);
    delay(m_keyIntervalDelayMs);
    return true;
}

bool ESP32BLEComboJIS::print(const char* text) {
    if (!keyboardEnabled() || text == nullptr) return false;
    while (*text) if (!write(static_cast<uint8_t>(*text++))) return false;
    releaseAll();
    return true;
}

bool ESP32BLEComboJIS::print(const String& text) { return print(text.c_str()); }

bool ESP32BLEComboJIS::press(uint8_t k) {
    if (!keyboardEnabled()) return false;
    if (k >= 136) k -= 136;
    else if (k >= 128) { m_keyReport.modifiers |= (1 << (k - 128)); k = 0; }
    else {
        k = pgm_read_byte(asciimap + k);
        if (!k) return false;
        if (k & 0x80) { m_keyReport.modifiers |= 0x02; k &= 0x7F; }
    }
    for (int i = 0; i < 6; i++) if (m_keyReport.keys[i] == 0) { m_keyReport.keys[i] = k; break; }
    sendKeyboardReport();
    return true;
}

bool ESP32BLEComboJIS::release(uint8_t k) {
    if (!keyboardEnabled()) return false;
    if (k >= 136) k -= 136;
    else if (k >= 128) { m_keyReport.modifiers &= ~(1 << (k - 128)); k = 0; }
    else {
        k = pgm_read_byte(asciimap + k);
        if (!k) return false;
        if (k & 0x80) { m_keyReport.modifiers &= ~0x02; k &= 0x7F; }
    }
    for (int i = 0; i < 6; i++) if (m_keyReport.keys[i] == k) m_keyReport.keys[i] = 0;
    sendKeyboardReport();
    return true;
}

bool ESP32BLEComboJIS::releaseAll() {
    if (!keyboardEnabled()) return false;
    memset(&m_keyReport, 0, sizeof(m_keyReport));
    sendKeyboardReport();
    return true;
}

bool ESP32BLEComboJIS::mouseMove(int x, int y) {
    if (!mouseEnabled()) return false;
    while (x != 0 || y != 0) {
        int8_t dx = x > 127 ? 127 : (x < -127 ? -127 : x);
        int8_t dy = y > 127 ? 127 : (y < -127 ? -127 : y);
        sendMouseReport(dx, dy, 0, m_mouseReport.buttons);
        delay(8);
        sendMouseReport(0, 0, 0, m_mouseReport.buttons);
        delay(8);
        x -= dx; y -= dy;
    }
    return true;
}

bool ESP32BLEComboJIS::mouseScroll(int amount) {
    if (!mouseEnabled()) return false;
    while (amount != 0) {
        int8_t step = amount > 127 ? 127 : (amount < -127 ? -127 : amount);
        sendMouseReport(0, 0, step, m_mouseReport.buttons);
        delay(8);
        sendMouseReport(0, 0, 0, m_mouseReport.buttons);
        delay(8);
        amount -= step;
    }
    return true;
}

bool ESP32BLEComboJIS::mousePress(uint8_t buttons) {
    if (!mouseEnabled()) return false;
    m_mouseReport.buttons |= buttons;
    sendMouseReport(0, 0, 0, m_mouseReport.buttons);
    return true;
}

bool ESP32BLEComboJIS::mouseRelease(uint8_t buttons) {
    if (!mouseEnabled()) return false;
    m_mouseReport.buttons &= ~buttons;
    sendMouseReport(0, 0, 0, m_mouseReport.buttons);
    return true;
}

bool ESP32BLEComboJIS::mouseClick(uint8_t buttons) {
    if (!mouseEnabled()) return false;
    mousePress(buttons); delay(20); mouseRelease(buttons); delay(20); return true;
}

bool ESP32BLEComboJIS::gamepadSetButtons(uint16_t buttons) {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.buttons = buttons; sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadPress(uint8_t buttonIndex) {
    if (!gamepadEnabled() || buttonIndex < 1 || buttonIndex > 16) return false;
    m_gamepadReport.buttons |= (1u << (buttonIndex - 1)); sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadRelease(uint8_t buttonIndex) {
    if (!gamepadEnabled() || buttonIndex < 1 || buttonIndex > 16) return false;
    m_gamepadReport.buttons &= ~(1u << (buttonIndex - 1)); sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadSetAxes(int16_t x, int16_t y, int16_t z, int16_t rz) {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.x = x; m_gamepadReport.y = y; m_gamepadReport.z = z; m_gamepadReport.rz = rz; sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadSetHat(uint8_t hat) {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.hat = hat; sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadReleaseAllButtons() {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.buttons = 0; sendGamepadReport(); return true;
}

bool ESP32BLEComboJIS::gamepadSetTriggers(int16_t leftTrigger, int16_t rightTrigger) {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.z = leftTrigger;
    m_gamepadReport.rz = rightTrigger;
    sendGamepadReport();
    return true;
}

bool ESP32BLEComboJIS::gamepadSetLeftStick(int16_t x, int16_t y) {
    if (!gamepadEnabled()) return false;
    m_gamepadReport.x = x;
    m_gamepadReport.y = y;
    sendGamepadReport();
    return true;
}

bool ESP32BLEComboJIS::gamepadSetRightStick(int16_t x, int16_t y) {
    if (!gamepadEnabled()) return false;
    if (m_config.gamepadLayout == ESP32BLEGamepadLayout::XBOX_STYLE) {
        m_gamepadReport.z = x;
        m_gamepadReport.rz = y;
    } else {
        m_gamepadReport.z = x;
        m_gamepadReport.rz = y;
    }
    sendGamepadReport();
    return true;
}
